Revit 2024 API
CurtainSystem.RemoveCurtainGrid Method
Remove CurtainGrid from the specified face for the CurtainSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RemoveCurtainGrid(
	Reference face
)
Visual Basic
Public Sub RemoveCurtainGrid ( _
	face As Reference _
)
Visual C++
public:
void RemoveCurtainGrid(
	Reference^ face
)
Parameters
face
Type: Autodesk.Revit.DB.Reference
The face CurtainGrid will be removed from.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input parameter face is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the CurtainGrid cannot be removed from the specified face or regenerate fails.
See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace